## Домашнее задание 3. Основы pandas

Ответом на это домашнее задание будет являться заполненный `ipynb` файл. В этом домашнем задании предлагается решить задачи ниже. В качестве ответа на домашнее задание  будет приниматься написанный в поле под задачей код на `Python` после поля `#ответ`.

Если вам нужна помощь в выполнении данного домашнего задания, пожалуйста, воспользуйтесь следующими open-source туториалами:  
1. https://nbviewer.org/github/justmarkham/pandas-videos/blob/master/pandas.ipynb - хороший ресурс, в котором вы можете найти справку по основным функциональностям пандаса, начиная с основ (базовых вещей), заканчивая чем-то более продвинутым. Здесь так же вы найдете несколько примеров выполнения различных функций.  Очень рекомендую пользоваться им как основным справочником.
2. https://github.com/guipsamora/pandas_exercises/ - здесь вы найдете 11 тем с примерами и ответами на них.

### 1. Загрузка библиотеки и таблицы

In [1]:
# загрузите библиотеку pandas 
import pandas as pd

In [2]:
# подгрузите таблицу kc_house_data.csv (https://disk.yandex.ru/i/7ZPhSId47D3WhQ)
df = pd.read_csv('kc_house_data.csv')

In [3]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

### 2. Исследование данных

**Как много NAN значений в колонке `yr_built`?**

In [4]:
#ответ

In [5]:
nan_count = df['yr_built'].isna().sum()
print(f"Количество NaN значений в колонке 'yr_built': {nan_count}")

Количество NaN значений в колонке 'yr_built': 0

**Сколько уникальных значений присутствует в колонке `yr_renovated`?**

In [6]:
#ответ

In [7]:
unique_count = df['yr_renovated'].nunique()
print(f"Количество уникальных значений в колонке 'yr_renovated': {unique_count}")

Количество уникальных значений в колонке 'yr_renovated': 70

**Чему равняется max, min, mean и std значения колонки `price`?**

In [8]:
#ответ

In [9]:
max_price = df['price'].max()
min_price = df['price'].min()
mean_price = df['price'].mean()
std_price = df['price'].std()

print(f"Максимальное значение в колонке 'price': {max_price}")
print(f"Минимальное значение в колонке 'price' : {min_price}")
print(f"Среднее значение в колонке 'price': {mean_price}")
print(f"Стандартное отклонение значений в колонке 'price': {std_price}")

Максимальное значение в колонке 'price': 7700000.0
Минимальное значение в колонке 'price' : 75000.0
Среднее значение в колонке 'price': 540088.1417665294
Стандартное отклонение значений в колонке 'price': 367127.19648269983

### 3. Выбор данных

**Сколько ванн в доме под строчкой 314?**

In [10]:
#ответ

In [11]:
df.loc[[314, 315]]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
314,4139480200,20141209T000000,1400000.0,4,3.25,4290,12103,1.0,0,3,...,11,2690,1600,1997,0,98006,47.5503,-122.102,3860,11244
315,1328320800,20141105T000000,305000.0,4,2.25,1950,7700,1.0,0,0,...,8,1350,600,1979,0,98058,47.4441,-122.125,2150,7350

In [12]:
bath_count = df.loc[315, 'bathrooms']
print(f"Количество ванн в доме под строчкой 314: {bath_count}")

Количество ванн в доме под строчкой 314: 2.25

**Чему ровняется столбец condition дома с индексом, равным 252000300?**

In [13]:
#ответ

In [14]:
condition_value = df.loc[df['id'] == 252000300]['condition'].values
print(f"Значение в столбце 'сondition' с индексом 252000300: {condition_value}")

Значение в столбце 'сondition' с индексом 252000300: [3]

**Чему ровняется значение столбца `floors` для домов, построенных в 1999 с 5 спальнями и `sqft living` равным 3400?**  
Решите, пользуясь `df[mask]`

In [15]:
#ответ

In [16]:
floors_values = df[(df['yr_built'] == 1999) & (df['bedrooms'] == 5) & (df['sqft_living'] == 3400)]['floors'].values
print(f"Значение столбца 'floors': {floors_values}")

Значение столбца 'floors': [2.]

**Какая цена самого дорого дома, построенного в промежутке с 1991 по 2000 года?**  
Решите с помощью `query`

In [17]:
#ответ

In [18]:
most_expensive_price = df.query("1991 <= yr_built <= 2000").sort_values('price', ascending=False).head(1)['price'].values[0]
print(f"Цена самого дорогого дома, построенного в промежутке с 1991 по 2000 года: {most_expensive_price}")

Цена самого дорогого дома, построенного в промежутке с 1991 по 2000 года: 5300000.0

**Какой наиболее чаще встречающийся `zipcode` среди домов `condition` которых равен 1 или 2 ?**

In [19]:
#ответ

In [20]:
common_zipcode = df[(df['condition'] == 1) | (df['condition'] == 2)]['zipcode'].mode().values[0]
print(f"Наиболее часто встречающийся zipcode: {common_zipcode}")

Наиболее часто встречающийся zipcode: 98118

Метод mode() возвращает наиболее часто встречающиеся значения в серии. Если есть несколько мод (несколько значений, которые встречаются одинаковое количество раз и являются наибольшими), mode() возвращает все такие значения в виде серии.

### 4. Создание новых колонок

**Создайте новую колонку с называнием `sqft_aver_floor`, где будет раниться результат вычисления деления `sqft_living` на `floors`. Отобразите таблицу, в которой будет содержаться этот столбец.**

In [21]:
#ответ

In [22]:
df['sqft_aver_floor'] = df['sqft_living'] / df['floors']
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,sqft_aver_floor
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,1180,0,1955,0,98178,47.5112,-122.257,1340,5650,1180.0
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639,1285.0
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,770,0,1933,0,98028,47.7379,-122.233,2720,8062,770.0
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,1050,910,1965,0,98136,47.5208,-122.393,1360,5000,1960.0
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,1680,0,1987,0,98074,47.6168,-122.045,1800,7503,1680.0

**Создайте новый столбец с названием `sqm_tot_living` полльзуясь колонкой `sqft_living` и зная, что 1 foot = 0.3048 метрам. Отобразите таблицу, в которой будет содержаться этот столбец.**

In [23]:
#ответ

In [24]:
df['sqm_tot_living'] = df['sqft_living'] * 0.3048 ** 2
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,sqft_aver_floor,sqm_tot_living
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,0,1955,0,98178,47.5112,-122.257,1340,5650,1180.0,109.625587
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,400,1951,1991,98125,47.7210,-122.319,1690,7639,1285.0,238.760813
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,0,1933,0,98028,47.7379,-122.233,2720,8062,770.0,71.535341
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,910,1965,0,98136,47.5208,-122.393,1360,5000,1960.0,182.089958
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,0,1987,0,98074,47.6168,-122.045,1800,7503,1680.0,156.077107

### 5. Препроцессинг данных

**Создайте столбцы `year`, `month`, `day`, `weekday` аналогично созданным на семинаре.**  
Постарайтесь решить здачу без подгляядки в семинарский `ipynb` файл

In [25]:
#ответ

In [26]:
# Конвертируем строку в datetime
df['date'] = pd.to_datetime(df['date'], format='%Y%m%dT%H%M%S')

# Извлекаем год, месяц, день и день недели
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df['weekday'] = df['date'].dt.day_name() 
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,lat,long,sqft_living15,sqft_lot15,sqft_aver_floor,sqm_tot_living,year,month,day,weekday
0,7129300520,2014-10-13,221900.0,3,1.00,1180,5650,1.0,0,0,...,47.5112,-122.257,1340,5650,1180.0,109.625587,2014,10,13,Monday
1,6414100192,2014-12-09,538000.0,3,2.25,2570,7242,2.0,0,0,...,47.7210,-122.319,1690,7639,1285.0,238.760813,2014,12,9,Tuesday
2,5631500400,2015-02-25,180000.0,2,1.00,770,10000,1.0,0,0,...,47.7379,-122.233,2720,8062,770.0,71.535341,2015,2,25,Wednesday
3,2487200875,2014-12-09,604000.0,4,3.00,1960,5000,1.0,0,0,...,47.5208,-122.393,1360,5000,1960.0,182.089958,2014,12,9,Tuesday
4,1954400510,2015-02-18,510000.0,3,2.00,1680,8080,1.0,0,0,...,47.6168,-122.045,1800,7503,1680.0,156.077107,2015,2,18,Wednesday

### 6. Функция Group by

**Создайте новую колонку с названием `price_by_year`, где будут храниться значения группировки колонки `year` и посчитано медианное (`.meadian()`) значение столбца `price`.**

In [27]:
#ответ

In [28]:
df['price_by_year'] = df.groupby('year')['price'].transform('median')
df['price_by_year']

0        450000.0
1        450000.0
2        450500.0
3        450000.0
4        450500.0
           ...
21608    450000.0
21609    450500.0
21610    450000.0
21611    450500.0
21612    450000.0
Name: price_by_year, Length: 21613, dtype: float64

**Создайте новую колонку с названием `area_by_price`, где будут храниться значения группировки колонки `condition` и посчитано среднее значение столбца `sqft_living`.**

In [29]:
#ответ

In [30]:
df['area_by_price'] = df.groupby('condition')['sqft_living'].transform('mean')
df ['area_by_price']

0        2149.042050
1        2149.042050
2        2149.042050
3        2022.911229
4        2149.042050
            ...
21608    2149.042050
21609    2149.042050
21610    2149.042050
21611    2149.042050
21612    2149.042050
Name: area_by_price, Length: 21613, dtype: float64

### Важно
Перед отправкой убедитесь, что все функции работают. Для этого выполните: File -> Save Notebook, Kernel -> Restart Kernel... в верхней панели и еще раз запустите все ячейки. Желаю успехов!